In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series(np.arange(5))
print("sum = ", np.sum(s))
print("mean = ", np.mean(s))

sum =  10
mean =  2.0

In [3]:
gdp = pd.read_csv("/home/qiwsir/Documents/DataAnalysis/chapter02/gdp-population.csv")
city_gdp = gdp.set_index('City_Name')
city_gdp

                GDP  Population
City_Name
SHANGHAI   27466.15     2419.70
BEIJING    24899.30     2172.90
GUANGZHOU  19610.90     1350.11
SHENZHEN   19492.60     1137.87
TIANJIN    17885.39     1562.12
CHONGQING  17558.76     3016.55
SUZHOU     15475.09     1375.00
CHENGDU    12170.20     1591.76

In [4]:
city_gdp.sum()

GDP           154558.39
Population     14626.01
dtype: float64

In [5]:
city_gdp.mean()

GDP           19319.79875
Population     1828.25125
dtype: float64

In [6]:
city_gdp.median()

GDP           18688.995
Population     1576.940
dtype: float64

In [7]:
b = np.arange(9).reshape(3,3)
b.mean(), b.mean(axis=0)

(4.0, array([ 3.,  4.,  5.]))

In [8]:
city_gdp.mean(axis=1)

City_Name
SHANGHAI     14942.925
BEIJING      13536.100
GUANGZHOU    10480.505
SHENZHEN     10315.235
TIANJIN       9723.755
CHONGQING    10287.655
SUZHOU        8425.045
CHENGDU       6880.980
dtype: float64

In [9]:
city_gdp.loc['HongLouShi'] = np.nan
city_gdp.mean()

GDP           19319.79875
Population     1828.25125
dtype: float64

In [10]:
city_gdp.describe()

                GDP   Population
count      8.000000     8.000000
mean   19319.798750  1828.251250
std     4908.677545   645.654074
min    12170.200000  1137.870000
25%    17037.842500  1368.777500
50%    18688.995000  1576.940000
75%    20933.000000  2234.600000
max    27466.150000  3016.550000

In [11]:
df = pd.DataFrame({"subject":['math', 'physics', 'english', 'math', 'physics', 'english'], 
                   'score':[90, 80, 70, 95, 85, 75]})
df

   score  subject
0     90     math
1     80  physics
2     70  english
3     95     math
4     85  physics
5     75  english

In [12]:
df.groupby("subject").sum()

         score
subject
english    145
math       185
physics    165

In [13]:
sub_group = df.groupby("subject")
sub_group

In [14]:
len(sub_group)

3

In [15]:
hasattr(sub_group, '__iter__')

True

In [16]:
for k, d in sub_group:
    print(k)
    print(d)

english
   score  subject
2     70  english
5     75  english
math
   score subject
0     90    math
3     95    math
physics
   score  subject
1     80  physics
4     85  physics

In [17]:
d = dict(list(sub_group))
d['physics']

   score  subject
1     80  physics
4     85  physics

In [18]:
sub_group.get_group("physics")

   score  subject
1     80  physics
4     85  physics

In [19]:
df['teacher'] = ['Netwon', 'Netwon', 'Pascal', 'Netwon', 'Pascal', 'Pascal']
df['rank'] = [4, 5, 2, 9, 7, 5]
df

   score  subject teacher  rank
0     90     math  Netwon     4
1     80  physics  Netwon     5
2     70  english  Pascal     2
3     95     math  Netwon     9
4     85  physics  Pascal     7
5     75  english  Pascal     5

In [20]:
df.groupby('subject').mean()

         score  rank
subject
english   72.5   3.5
math      92.5   6.5
physics   82.5   6.0

In [21]:
df.groupby(df['subject']).mean()

         score  rank
subject
english   72.5   3.5
math      92.5   6.5
physics   82.5   6.0

In [22]:
type(df['subject'])

pandas.core.series.Series

In [23]:
df.groupby(['teacher', 'subject']).mean()

                 score  rank
teacher subject
Netwon  math      92.5   6.5
        physics   80.0   5.0
Pascal  english   72.5   3.5
        physics   85.0   7.0

In [24]:
df.groupby(['teacher', 'subject'])['score'].mean()

teacher  subject
Netwon   math       92.5
         physics    80.0
Pascal   english    72.5
         physics    85.0
Name: score, dtype: float64

In [25]:
data = pd.DataFrame(np.random.randn(6, 6), columns=["a", "b", "c", "d", "e", "f"], 
                    index=["first", "second", "third", "forth", "fifth", "sixth"])
data

               a         b         c         d         e         f
first   0.058927  2.225564  0.798945  0.596528  0.436591 -0.219454
second -1.414094  1.411826  0.554577 -2.313978 -0.438249 -0.152348
third  -1.797961 -1.012777  0.983753 -0.617068  0.343438 -0.531680
forth  -0.121519 -1.524636 -0.819590  0.867102  0.476899  0.074630
fifth   0.671019 -0.261099 -0.528443  2.802857 -0.634232  0.906378
sixth   0.100855  0.205882 -0.251229  0.300717 -0.967317 -0.950322

In [26]:
lst = ["one", "one", "one", "two", "two", "two"]
data.groupby(lst, axis=1).mean()

             one       two
first   1.027812  0.271222
second  0.184103 -0.968192
third  -0.608995 -0.268437
forth  -0.821915  0.472877
fifth  -0.039508  1.025001
sixth   0.018503 -0.538974

In [27]:
mapping = {'a':"one", 'b':"one", 'c':"one", 'd':"two", 'e':"two", 'f':"two"}
data.groupby(mapping, axis=1).mean()

             one       two
first   1.027812  0.271222
second  0.184103 -0.968192
third  -0.608995 -0.268437
forth  -0.821915  0.472877
fifth  -0.039508  1.025001
sixth   0.018503 -0.538974

In [28]:
series_map = pd.Series(mapping)
data.groupby(series_map, axis=1).mean()

             one       two
first   1.027812  0.271222
second  0.184103 -0.968192
third  -0.608995 -0.268437
forth  -0.821915  0.472877
fifth  -0.039508  1.025001
sixth   0.018503 -0.538974

In [29]:
def is_t(name):    #创建一个函数，判断对象中是否含有字母“t”。
    if "t" in name:
        return True
    else:
        return False
data.groupby(is_t).mean()

              a         b         c         d         e         f
False -1.414094  1.411826  0.554577 -2.313978 -0.438249 -0.152348
True  -0.217736 -0.073413  0.036687  0.790027 -0.068924 -0.144090

In [30]:
data.groupby(len).mean()

          a         b         c         d         e         f
5 -0.217736 -0.073413  0.036687  0.790027 -0.068924 -0.144090
6 -1.414094  1.411826  0.554577 -2.313978 -0.438249 -0.152348

In [31]:
index_lst = ['A', 'B', 'C', 'A', 'B', 'C']
data.groupby([is_t, index_lst]).mean()

                a         b         c         d         e         f
False B -1.414094  1.411826  0.554577 -2.313978 -0.438249 -0.152348
True  A -0.031296  0.350464 -0.010322  0.731815  0.456745 -0.072412
      B  0.671019 -0.261099 -0.528443  2.802857 -0.634232  0.906378
      C -0.848553 -0.403447  0.366262 -0.158175 -0.311940 -0.741001

In [32]:
df.groupby('teacher')['score'].describe()

         count       mean       std   min   25%   50%   75%   max
teacher
Netwon     3.0  88.333333  7.637626  80.0  85.0  90.0  92.5  95.0
Pascal     3.0  76.666667  7.637626  70.0  72.5  75.0  80.0  85.0

In [33]:
df.groupby("teacher").aggregate(['mean', 'std', 'max'])

             score                    rank
              mean       std max      mean       std max
teacher
Netwon   88.333333  7.637626  95  6.000000  2.645751   9
Pascal   76.666667  7.637626  85  4.666667  2.516611   7

In [34]:
df.groupby('teacher').aggregate(np.median)

         score  rank
teacher
Netwon      90     5
Pascal      75     5

In [35]:
df.groupby("teacher").median()

         score  rank
teacher
Netwon      90     5
Pascal      75     5

In [36]:
def distance(x):
    return x.max() - x.min() 

df.groupby('teacher')['score'].agg(distance)

teacher
Netwon    15
Pascal    15
Name: score, dtype: int64

In [37]:
df.groupby('teacher').aggregate({"score":np.mean, 'rank':np.median})

             score  rank
teacher
Netwon   88.333333     5
Pascal   76.666667     5

In [38]:
df.groupby('teacher').aggregate({"score":['max', 'min', np.mean], 'rank':'std'})

        score                     rank
          max min       mean       std
teacher
Netwon     95  80  88.333333  2.645751
Pascal     85  70  76.666667  2.516611

In [39]:
df

   score  subject teacher  rank
0     90     math  Netwon     4
1     80  physics  Netwon     5
2     70  english  Pascal     2
3     95     math  Netwon     9
4     85  physics  Pascal     7
5     75  english  Pascal     5

In [40]:
df.groupby('subject').mean()

         score  rank
subject
english   72.5   3.5
math      92.5   6.5
physics   82.5   6.0

In [41]:
def high_rank(x):
    return x['rank'].mean() > 5

In [42]:
df.groupby('subject').filter(high_rank)

   score  subject teacher  rank
0     90     math  Netwon     4
1     80  physics  Netwon     5
3     95     math  Netwon     9
4     85  physics  Pascal     7

In [43]:
df.groupby('subject').filter(lambda x: x['rank'].mean() > 5)

   score  subject teacher  rank
0     90     math  Netwon     4
1     80  physics  Netwon     5
3     95     math  Netwon     9
4     85  physics  Pascal     7

In [44]:
df.groupby("subject").transform(lambda x: x - x.mean())

   score  rank
0   -2.5  -2.5
1   -2.5  -1.0
2   -2.5  -1.5
3    2.5   2.5
4    2.5   1.0
5    2.5   1.5

In [45]:
df_subject = df.groupby("subject")
def rank_score(x):    #创建一个函数
    x['rank_score'] = x['score'] * x['rank'].std()
    return x
df_subject.apply(rank_score)

   score  subject teacher  rank  rank_score
0     90     math  Netwon     4  318.198052
1     80  physics  Netwon     5  113.137085
2     70  english  Pascal     2  148.492424
3     95     math  Netwon     9  335.875721
4     85  physics  Pascal     7  120.208153
5     75  english  Pascal     5  159.099026

In [46]:
df_subject['rank'].std()

subject
english    2.121320
math       3.535534
physics    1.414214
Name: rank, dtype: float64

In [47]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [48]:
titanic.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [49]:
titanic.groupby(['sex', 'class'])['survived'].aggregate('mean').unstack()

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [50]:
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [51]:
ages = pd.cut(titanic['age'], [0, 18, 60, 80])
titanic.pivot_table('survived', index=['sex', ages], columns='class')

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 60]  0.972222  0.900000  0.413793
       (60, 80]  1.000000       NaN  1.000000
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 60]  0.416667  0.061728  0.136364
       (60, 80]  0.083333  0.333333  0.000000

In [52]:
x = pd.Series([20, 25, 30, 35, 40])
bins = [10, 30, 40]
pd.cut(x, bins)

0    (10, 30]
1    (10, 30]
2    (10, 30]
3    (30, 40]
4    (30, 40]
dtype: category
Categories (2, interval[int64]): [(10, 30] < (30, 40]]